// chitem.cpp : Defines the class behaviors for the application.
//

#include "stdafx.h"

#include <fcntl.h>
#include <sys/stat.h>
#include <direct.h>
#include <process.h>
#include <mmsystem.h>
#include "2da.h"
#include "chitem.h"
#include "chitemDlg.h"
#include "zlib.h"
#include "acmsound.h"
#include "options.h"

#ifdef _DEBUG
#define new DEBUG_NEW
#undef THIS_FILE
static char THIS_FILE[] = __FILE__;
#endif

#define BLOCKSIZE  8192

UINT WM_FINDREPLACE = ::RegisterWindowMessage(FINDMSGSTRING);

//globally used constants
const unsigned char xorblock[64]={
  0x88,0xA8,0x8F,0xBA,0x8A,0xD3,0xB9,0xF5,0xED,0xB1,0xCF,0xEA,0xAA,
    0xE4,0xB5,0xFB,0xEB,0x82,0xF9,0x90,0xCA,0xC9,0xB5,0xE7,0xDC,0x8E,
    0xB7,0xAC,0xEE,0xF7,0xE0,0xCA,0x8E,0xEA,0xCA,0x80,0xCE,0xC5,0xAD,
    0xB7,0xC4,0xD0,0x84,0x93,0xD5,0xF0,0xEB,0xC8,0xB4,0x9D,0xCC,0xAF,
    0xA5,0x95,0xBA,0x99,0x87,0xD2,0x9D,0xE3,0x91,0xBA,0x90,0xCA,
};

const unsigned short objrefs[NUM_OBJTYPE+1]={
  0,REF_2DA,REF_ACM,REF_ARE,REF_BAM,REF_BCS,REF_BMP,REF_CHU,REF_CRE,REF_DLG,//10
    REF_EFF,REF_GAM,REF_IDS,REF_INI,REF_ITM,REF_MOS,REF_MUS,REF_MVE,REF_PLT,//19
    REF_PRO,REF_SPL,REF_SRC,REF_STO,REF_TIS,REF_VEF,REF_VVC,REF_WAV,REF_WED,//28
    REF_WFX,REF_WMP,//30
};

const CString objexts[NUM_OBJTYPE+1]={
  ".*",".2da",".acm",".are",".bam",".bcs",".bmp",".chu",".cre",".dlg",//10
    ".eff",".gam",".ids",".ini",".itm",".mos",".mus",".mve",".plt",".pro",//20
    ".spl",".src",".sto",".tis",".vef",".vvc",".wav",".wed",".wfx",".wmp",//30

"31-Inventory 7","32-Inventory 8","33-Inventory 9","34-Inventory 10","35-Inventory 11","36-Inventory 12",
"37-Inventory 13","38-Inventory 14","39-Inventory 15","40-Inventory 16",
"41-Inventory 17","42-Inventory 18","43-Inventory 19","44-Inventory 20","45-Inventory 21","46-Inventory 22",
"47-Inventory 23","48-Inventory 24","49-Magic"};

int itvs2h[NUM_ITEMTYPE]={
  1,1,1,1,1,1,1,1,1,1,//9
  1,1,1,1,1,2,1,1,1,1,3,//14
  3,1,1,1,3,2,3,1,2,2,//1e
  1,1,1,1,1,1,1,1,5,5,//28  
  5,5,5,5,5,5,5,5,5,//31
  5,5,5,5,5,5,5,6,  //39
  5,5,5,5,5,5,5,5,  //41
  5,5,5,5,5,5,5,5   //49
};

//inifile
CString setupname;
CString bgfolder;
CString descpath;
CString weidupath;
CString weiduextra;
CString weidudecompiled;
int logtype;
int tooltips;
int do_progress;
int readonly;
int whichdialog;
int choosedialog;
unsigned long chkflg;
unsigned long editflg;
unsigned long optflg;
unsigned long weiduflg;
COLORREF color1, color2, color3;

/// game objects
CString itemname;
CString lasterrormsg;
Citem the_item;
Cstore the_store;
Cproj the_projectile;
Cspell the_spell;
Ceffect the_effect;
Ccreature the_creature;
CVVC the_videocell;
Cscript the_script;
Cdialog the_dialog;
Carea the_area;
Cbam the_bam;
Cgame the_game;
Cmap the_map;
Cmos the_mos;
C2da the_2da;
Cids the_ids;
Cmus the_mus;
Cchui the_chui;
Csrc the_src;
Cini the_ini;
long creature_strrefs[SND_SLOT_COUNT];

//2da, ids
CStringMapInt dial_references;
CStringList exclude_item;
CStringList xplist;
CStringList pro_references;
CStringList pro_titles;
CStringList beastnames;
CStringList beastkillvars;
CStringList spawngroup;
CStringMapInt rnditems;             //this is the mapping for ignored items (random treasure)
CStringMapArray store_spell_desc;
CStringList sectype_names;
CStringList school_names;
CString2List songlist;
int base_slot=35;
CStringMapInt internal_slot_names;
CString slot_names[IWD2_SLOT_COUNT]; //IWD2 has more slots
CString snd_slots[SND_SLOT_COUNT];
CString action_defs[MAX_ACTION];
CString trigger_defs[MAX_TRIGGER];
CStringMapCStringMapInt idsmaps; //this is a cstring map to a cstringmapint
CIntMapString listspells;        //iwd2 spell list (number to resref mapping)
CIntMapString listdomains;       //iwd2 domain spell list (number to resref mapping)
CIntMapString listinnates;       //iwd2 innate list (number to resref mapping)
CIntMapString listsongs;         //iwd2 song list (number to resref mapping)
CIntMapString listshapes;        //iwd2 wildshape list (number to resref mapping)
CStringMapInt ini_entry;         //acceptable spawn ini entries

CColorPicker colordlg;
CItemPicker pickerdlg;

//tlk/chitin
tlk_header tlk_headerinfo[2];
tlk_entry *tlk_entries[2];
bool global_changed[2]; //tlk_entries have changed (need save)
int global_date[2];
key_header key_headerinfo;
membif_entry *bifs;
CString cds[NUM_CD];

CStringMapLocEntry items;//1
CStringMapLocEntry icons;//2
CStringMapLocEntry bitmaps;//3
CStringMapLocEntry creatures;//4
CStringMapLocEntry spells;//5
CStringMapLocEntry stores;//6
CStringMapLocEntry darefs;//7
CStringMapLocEntry idrefs;//8
CStringMapLocEntry dialogs;//9
CStringMapLocEntry scripts;//10
CStringMapLocEntry projects;//11
CStringMapLocEntry effects;//12
CStringMapLocEntry vvcs;//13
CStringMapLocEntry areas;//14
CStringMapLocEntry chuis;//15
CStringMapLocEntry mos;//16
CStringMapLocEntry weds;//17
CStringMapLocEntry tis;//18
CStringMapLocEntry sounds;//19
CStringMapLocEntry games;//20
CStringMapLocEntry wmaps;//21
CStringMapLocEntry musics;//22
CStringMapLocEntry musiclists;//23
CStringMapLocEntry movies;//24
CStringMapLocEntry wfxs;//25
CStringMapLocEntry strings; //26
CStringMapLocEntry paperdolls; //27
CStringMapLocEntry vefs; //28
CStringMapLocEntry inis; //29

CStringListLocEntry d_items;//1
CStringListLocEntry d_icons;//2
CStringListLocEntry d_bitmaps;//3
CStringListLocEntry d_creatures;//4
CStringListLocEntry d_spells;//5
CStringListLocEntry d_stores;//6
CStringListLocEntry d_darefs;//7
CStringListLocEntry d_idrefs;//8
CStringListLocEntry d_dialogs;//9
CStringListLocEntry d_scripts;//10
CStringListLocEntry d_projects;//11
CStringListLocEntry d_effects;//12
CStringListLocEntry d_vvcs;//13
CStringListLocEntry d_areas;//14
CStringListLocEntry d_chuis;//15
CStringListLocEntry d_mos;//16
CStringListLocEntry d_weds;//17
CStringListLocEntry d_tis;//18
CStringListLocEntry d_sounds;//19
CStringListLocEntry d_games;//20
CStringListLocEntry d_wmaps;//21
CStringListLocEntry d_musics;//22
CStringListLocEntry d_musiclists;//23
CStringListLocEntry d_movies;//24
CStringListLocEntry d_wfxs;//25
CStringListLocEntry d_strings; //26
CStringListLocEntry d_paperdolls; //27
CStringListLocEntry d_vefs; //28
CStringListLocEntry d_inis; //29
  
CStringMapLocEntry *resources[NUM_OBJTYPE+1]={0,&darefs,&musics,
&areas, &icons, &scripts,&bitmaps, &chuis, &creatures,
&dialogs, &effects, &games,&idrefs, &inis,&items, &mos,&musiclists,
&movies,&paperdolls,&projects,&spells,&strings,
&stores,&tis,&vefs,&vvcs,&sounds,&weds,&wfxs,&wmaps,
};
CStringListLocEntry *duplicates[NUM_OBJTYPE+1]={0,&d_darefs,&d_musics,
&d_areas, &d_icons, &d_scripts, &d_bitmaps, &d_chuis, &d_creatures,
&d_dialogs, &d_effects, &d_games, &d_idrefs, &d_inis, &d_items, &d_mos,
&d_musiclists,&d_movies, &d_paperdolls, &d_projects, &d_spells, &d_strings,
&d_stores,&d_tis, &d_vefs, &d_vvcs,&d_sounds, &d_weds, &d_wfxs, &d_wmaps,
};

CStringMapInt variables;
CIntMapString journals;

///
/////////////////////////////////////////////////////////////////////////////
// CChitemApp

BEGIN_MESSAGE_MAP(CChitemApp, CWinApp)
//{{AFX_MSG_MAP(CChitemApp)
//}}AFX_MSG
//ON_COMMAND(ID_HELP, CWinApp::OnHelp)
END_MESSAGE_MAP()

